Crazy-Charles/Arduino_Core_STM32_N32/system/Drivers/CMSIS/Include/n32g455xe.h
#define FLASH_BASE            0x08000000UL /*!< FLASH base address in the alias region */
#define FLASH_BANK1_END       0x0807FFFFUL /*!< FLASH END address of bank1 */
#define SRAM_BASE             0x20000000UL /*!< SRAM base address in the alias region */
#define PERIPH_BASE           0x40000000UL /*!< Peripheral base address in the alias region */

#define SRAM_BB_BASE          0x22000000UL /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE        0x42000000UL /*!< Peripheral base address in the bit-band region */

#define UCID_BASE ((uint32_t)0x1FFFF7C0)      /*!< UCID Address : 0x1FFF_F7C0 */
#define UCID_LENGTH ((uint32_t)0x10)          /*!< UCID Length  : 16Bytes */
#define UID_BASE ((uint32_t)0x1FFFF7F0)       /*!< UID Address  : 0x1FFF_F7F0 */
#define UID_LENGTH ((uint32_t)0x0C)           /*!< UID Length   : 12Bytes */
#define DBGMCU_ID_BASE ((uint32_t)0xE0042000) /*!< DBGMCU_ID Address */
#define DBGMCU_ID_LENGTH ((uint8_t)0x04)      /*!< DBGMCU_ID Length : 4 Bytes */

#define FSMC_BASE             0x60000000UL /*!< FSMC base address */
#define FSMC_R_BASE           0xA0000000UL /*!< FSMC registers base address */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000UL)
//#define AHBPERIPH_BASE        (PERIPH_BASE + 0x00020000UL)
#define AHBPERIPH_BASE (PERIPH_BASE + 0x18000)

/* APB1 */
#define TIM2_BASE (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE (APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE (APB1PERIPH_BASE + 0x1400)
#define AFEC_BASE (APB1PERIPH_BASE + 0x1800)
#define OPAMP_BASE (APB1PERIPH_BASE + 0x2000)
#define COMP_BASE (APB1PERIPH_BASE + 0x2400)
#define RTC_BASE (APB1PERIPH_BASE + 0x2800)
#define WWDG_BASE (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE (APB1PERIPH_BASE + 0x3000)
#define TSC_BASE (APB1PERIPH_BASE + 0x3400)
#define SPI2_BASE (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE (APB1PERIPH_BASE + 0x3C00)
#define USART2_BASE (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE (APB1PERIPH_BASE + 0x5800)
#define USB_BASE (APB1PERIPH_BASE + 0x5C00)
#define USB_CAN1_SRAM_BASE (APB1PERIPH_BASE + 0x6000)
#define CAN1_BASE (APB1PERIPH_BASE + 0x6400)
#define CAN2_BASE (APB1PERIPH_BASE + 0x6800)
#define BKP_BASE (APB1PERIPH_BASE + 0x6C00)
#define PWR_BASE (APB1PERIPH_BASE + 0x7000)
#define DAC_BASE (APB1PERIPH_BASE + 0x7400)

// #define TIM2_BASE             (APB1PERIPH_BASE + 0x00000000UL)
// #define TIM3_BASE             (APB1PERIPH_BASE + 0x00000400UL)
// #define TIM4_BASE             (APB1PERIPH_BASE + 0x00000800UL)
// #define TIM5_BASE             (APB1PERIPH_BASE + 0x00000C00UL)
// #define TIM6_BASE             (APB1PERIPH_BASE + 0x00001000UL)
// #define TIM7_BASE             (APB1PERIPH_BASE + 0x00001400UL)
// #define RTC_BASE              (APB1PERIPH_BASE + 0x00002800UL)
// #define WWDG_BASE             (APB1PERIPH_BASE + 0x00002C00UL)
// #define IWDG_BASE             (APB1PERIPH_BASE + 0x00003000UL)
// #define SPI2_BASE             (APB1PERIPH_BASE + 0x00003800UL)
// #define SPI3_BASE             (APB1PERIPH_BASE + 0x00003C00UL)
// #define USART2_BASE           (APB1PERIPH_BASE + 0x00004400UL)
// #define USART3_BASE           (APB1PERIPH_BASE + 0x00004800UL)
// #define UART4_BASE            (APB1PERIPH_BASE + 0x00004C00UL)
// #define UART5_BASE            (APB1PERIPH_BASE + 0x00005000UL)
// #define I2C1_BASE             (APB1PERIPH_BASE + 0x00005400UL)
// #define I2C2_BASE             (APB1PERIPH_BASE + 0x00005800UL)
// #define CAN1_BASE             (APB1PERIPH_BASE + 0x00006400UL)
// #define BKP_BASE              (APB1PERIPH_BASE + 0x00006C00UL)
// #define PWR_BASE              (APB1PERIPH_BASE + 0x00007000UL)
// #define DAC_BASE              (APB1PERIPH_BASE + 0x00007400UL)

/* APB2 */
#define AFIO_BASE (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE (APB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE (APB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE (APB2PERIPH_BASE + 0x1400)
#define GPIOE_BASE (APB2PERIPH_BASE + 0x1800)
#define GPIOF_BASE (APB2PERIPH_BASE + 0x1C00)
#define GPIOG_BASE (APB2PERIPH_BASE + 0x2000)
#define TIM1_BASE (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE (APB2PERIPH_BASE + 0x3000)
#define TIM8_BASE (APB2PERIPH_BASE + 0x3400)
#define USART1_BASE (APB2PERIPH_BASE + 0x3800)
#define I2C3_BASE (APB2PERIPH_BASE + 0x4400)
#define I2C4_BASE (APB2PERIPH_BASE + 0x4800)
#define DVP_BASE (APB2PERIPH_BASE + 0x4C00)
#define UART6_BASE (APB2PERIPH_BASE + 0x5000)
#define UART7_BASE (APB2PERIPH_BASE + 0x5400)

// #define AFIO_BASE             (APB2PERIPH_BASE + 0x00000000UL)
// #define EXTI_BASE             (APB2PERIPH_BASE + 0x00000400UL)
// #define GPIOA_BASE            (APB2PERIPH_BASE + 0x00000800UL)
// #define GPIOB_BASE            (APB2PERIPH_BASE + 0x00000C00UL)
// #define GPIOC_BASE            (APB2PERIPH_BASE + 0x00001000UL)
// #define GPIOD_BASE            (APB2PERIPH_BASE + 0x00001400UL)
// #define GPIOE_BASE            (APB2PERIPH_BASE + 0x00001800UL)
// #define GPIOF_BASE            (APB2PERIPH_BASE + 0x00001C00UL)
// #define GPIOG_BASE            (APB2PERIPH_BASE + 0x00002000UL)
// #define ADC1_BASE             (APB2PERIPH_BASE + 0x00002400UL)
// #define ADC2_BASE             (APB2PERIPH_BASE + 0x00002800UL)
// #define TIM1_BASE             (APB2PERIPH_BASE + 0x00002C00UL)
// #define SPI1_BASE             (APB2PERIPH_BASE + 0x00003000UL)
// #define TIM8_BASE             (APB2PERIPH_BASE + 0x00003400UL)
// #define USART1_BASE           (APB2PERIPH_BASE + 0x00003800UL)
// #define ADC3_BASE             (APB2PERIPH_BASE + 0x00003C00UL)

/* AHB */
#define SDIO_BASE (AHBPERIPH_BASE + 0x0000)
#define DMA1_BASE (AHBPERIPH_BASE + 0x8000)
#define DMA1_CH1_BASE (AHBPERIPH_BASE + 0x8008)
#define DMA1_CH2_BASE (AHBPERIPH_BASE + 0x801C)
#define DMA1_CH3_BASE (AHBPERIPH_BASE + 0x8030)
#define DMA1_CH4_BASE (AHBPERIPH_BASE + 0x8044)
#define DMA1_CH5_BASE (AHBPERIPH_BASE + 0x8058)
#define DMA1_CH6_BASE (AHBPERIPH_BASE + 0x806C)
#define DMA1_CH7_BASE (AHBPERIPH_BASE + 0x8080)
#define DMA1_CH8_BASE (AHBPERIPH_BASE + 0x8094)
#define DMA2_BASE (AHBPERIPH_BASE + 0x8400)
#define DMA2_CH1_BASE (AHBPERIPH_BASE + 0x8408)
#define DMA2_CH2_BASE (AHBPERIPH_BASE + 0x841C)
#define DMA2_CH3_BASE (AHBPERIPH_BASE + 0x8430)
#define DMA2_CH4_BASE (AHBPERIPH_BASE + 0x8444)
#define DMA2_CH5_BASE (AHBPERIPH_BASE + 0x8458)
#define DMA2_CH6_BASE (AHBPERIPH_BASE + 0x846C)
#define DMA2_CH7_BASE (AHBPERIPH_BASE + 0x8480)
#define DMA2_CH8_BASE (AHBPERIPH_BASE + 0x8494)
#define ADC1_BASE (AHBPERIPH_BASE + 0x8800)
#define ADC2_BASE (AHBPERIPH_BASE + 0x8C00)
#define RCC_BASE (AHBPERIPH_BASE + 0x9000)
#define ADC3_BASE (AHBPERIPH_BASE + 0x9800)
#define ADC4_BASE (AHBPERIPH_BASE + 0x9C00)
#define FLASH_R_BASE (AHBPERIPH_BASE + 0xA000) /*!< Flash registers base address */
#define OB_BASE ((uint32_t)0x1FFFF800)         /*!< Flash Option Bytes base address */
#define CRC_BASE (AHBPERIPH_BASE + 0xB000)
#define SAC_BASE (AHBPERIPH_BASE + 0xC000)
#define SAC_SRAM_BASE (AHBPERIPH_BASE + 0xC400)
#define MMU_BASE (AHBPERIPH_BASE + 0xCC00)
#define ETH_BASE (AHBPERIPH_BASE + 0x10000)

// #define SDIO_BASE             (PERIPH_BASE + 0x00018000UL)

